app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @messages = Message.all

INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", ""], ["created_at", "2016-07-19 00:45:36.094129"], ["updated_at", "2016-07-19 00:45:36.094129"]]
---
  def create
    @message = Message.new(message_params)

    if @message.save