app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

INSERT INTO "records" ("title", "amount", "date", "tag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Fail"], ["amount", 1.0], ["date", "0002-02-22"], ["tag", ""], ["created_at", "2016-04-16 02:52:35.654203"], ["updated_at", "2016-04-16 02:52:35.654203"]]
---
  def create
    @record = Record.new(record_params)

    if @record.save

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "records" SET "title" = ?, "amount" = ?, "date" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["title", "Taco Bell"], ["amount", 2.0], ["date", "2016-01-06"], ["updated_at", "2016-01-08 08:19:04.945593"], ["id", 1]]
---
  def update
    @record = Record.find(params[:id])
    if @record.update(record_params)